#Область ПрограммныйИнтерфейс

#Область Metadata

Функция GetMeta(Запрос)
	
	Мета = Новый Структура;
	Мета.Вставить("name", Метаданные.Имя);
	Мета.Вставить("version", Метаданные.Версия);
	Мета.Вставить("hydra_version", ВерсияРасширения());
	
	Возврат ПодготовитьОтвет(Мета);

КонецФункции

#КонецОбласти

#Область UserManager

Функция GetUser(Запрос)
	
	СписокПользователей = Новый Массив;
	
	Выборка = Справочники.Пользователи.Выбрать();
	Пока Выборка.Следующий() Цикл
		Пользователь = Новый Структура;
		Пользователь.Вставить("name", Выборка.Наименование);
		Пользователь.Вставить("id", XMLСтрока(Выборка.ИдентификаторПользователяИБ));
		Пользователь.Вставить("active", Не Выборка.Недействителен);
		СписокПользователей.Добавить(Пользователь);
	КонецЦикла;
	
	Возврат ПодготовитьОтвет(СписокПользователей);
	
КонецФункции

Функция CreateUser(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция EditUser(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция RemoveUser(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПодготовитьОтвет(Объект)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	
	Ответ.УстановитьТелоИзСтроки(ОбъектВJson(Объект));
	
	Возврат Ответ;
	
КонецФункции

Функция ОбъектВJson(Объект, ПараметрыПреобразования = Неопределено) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(, "   "));
	ЗаписатьJSON(ЗаписьJSON, Объект,,,, ПараметрыПреобразования);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция ВерсияРасширения()
	
	Расширение = РасширенияКонфигурации.Получить(Новый Структура("Имя", "HYDRA"))[0];
	
	Возврат Расширение.Версия;
	
КонецФункции

#КонецОбласти