
Функция metaПолучитьМетаинформацию(Запрос)
	
	Мета = Новый Структура;
	Мета.Вставить("version", Метаданные.Версия);
	Мета.Вставить("hydra_version", Версия());
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(СтруктураВJson(Мета));
	Возврат Ответ;
КонецФункции

Функция userУдалитьПользователя(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция userИзменитьПользователя(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция userДобавитьПользователя(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция userПолучитьПользователей(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция Версия()
	
	Расширение = РасширенияКонфигурации.Получить(Новый Структура("Имя", "HYDRA"))[0];
	
	Возврат Расширение.Версия;
	
КонецФункции

// Преобразует структура в строку JSON. Двоичные данные преобразуются в строки Base64.
//
// Параметры:
//  СтрокаJSON              - Структура - структура, которую необхоидимо преобразовать в строку JSON.
//  ПараметрыПреобразования - Структуруа - Дополнительные параметры, 
//                            которые будут переданы в функцию восстановления значений.
//
Функция СтруктураВJson(Объект, ПараметрыПреобразования = Неопределено) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(
		ЗаписьJSON, 
		Объект,,,, 
		ПараметрыПреобразования);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции
